# AirViscosity Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
DuctSettings..::..AirViscosity Property
DuctSettings Class See Also
---
The air dynamic viscosity.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double AirViscosity { get; set; }
```

Visual Basic
---
```text
Public Property AirViscosity As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double AirViscosity {
	double get ();
	void set (double value);
}
```

# See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace